IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.
AUTHOR. YourName.
DATE-WRITTEN. August 19, 2023.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-PC.
OBJECT-COMPUTER. IBM-PC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MESSAGE PIC X(20) VALUE "Hello, COBOL!".
PROCEDURE DIVISION.
    DISPLAY MESSAGE.
    STOP RUN.
